# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# list_1 = []
# N = int(input('Введите кол-во чисел: '))
# for i in range(N):
#     list_1.append(int(input()))
# X = int(input('Введите число: '))
# count = 0
# for i in range(N):
#     print(f'Число {X} встречается в списке А {list_1.count(X)} раз')

# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# list_1 = []
# N = int(input('Введите кол-во чисел: '))
# for i in range(N):
#     list_1.append(int(input()))
# X = int(input('Введите число: '))
# number = 0
# for i in range(len(list_1)):
#     if (X-list_1[i]) < X - number and X-list_1[i] > 0:
#         number = i
# print(list_1[number])







